// Задача 3
// Даны два целых числа. Вывести на экран большее из них.
// Пример 1
// 5, 4
// Наибольшее число:5
// Пример 2
// 9, 25
// Наибольшее число:25

int a = 79;
int b = 15;
if (a > b)
{
    Console.WriteLine($"Наибольшее число {a}");
}
else
{
    System.Console.WriteLine($"Наибольшее число {b}");
}
